{"results":[{"content":{"url":"https://www.amazon.com/product-reviews/B07YVYZ8T5?reviewerType=all_reviews&pageNumber=1","asin":"B07YVYZ8T5","page":1,"pages":730,"reviews":[{"id":"RAI90QWJQJF03","title":"5.0 out of 5 stars Literally mind-blowing upgrading from AirPods Pro 2","author":"Christian Waymire","rating":5,"content":"Beats**all coming from an airpods & airpods pro 2 user**Two notes about me:* I have a pretty average sized head & ears* I wear glassesThoughts:- Noise isolation is way better than people give credit for, works about as well as the active noise cancellation on my airpods pro 2.- I can FEEL the bass.- Can hear all kinds of details in music (like when I upgraded to airpods pro but slightly better than even those). The AirPods gen 2 did that for me, then the AirPods Pro 2 did it again, and now these are doing the same.- Electronic music sounds absolutely amazing. Better than any other headphones or speaker I’ve heard.- Classical sounds amazing—way better than AirPods Pro 2.- Folk sounds amazing, & it’s like someone’s playing a really high end guitar right next to me while also serenading me.- Piano also sounds especially amazing- Case is slightly padded, but leaves a lot to be desired there—they also barely fit (see pictures).- They feel durable, even at hinges (which shocked me).- They DO fingerprint easily, if that matters to you.- Box is very sleek & giftable.- Not having the automatic ear detection is really nice for when I lift one side up to hear someone or something.- They are more comfortable than AirPods Pro, even with memory foam ear tips on those. But they do get slightly annoying with glasses but there is a sweet spot where it’s not bad (if I angle the headband towards the back of my head instead of having it straight up and down). But it’s not so uncomfortable that I don’t want to use them. Merely a minor inconvenience.- I ever so slightly wish I could see the battery percentage on my phone while charging, but it’s not any real inconvenience.- The micro-USB charger is potentially going to be a slight inconvenience because they wear out—USB-C or a lightening cord would’ve been way better.- Pairing with an iPhone is extremely easy.- The included carabiner for the case is a nice afterthought, but it’s a super flimsy carabiner and the loop keeping it on the case is tiny and I wouldn’t trust it. If it were better sewn and had a bigger loop, that’d be fantastic. I CAN attach an aluminum locking carabiner, but it’s just barely big enough for that.- Charging seems pretty fast, and while I do wish it would show me the percentage while charging, I really appreciate seeing the percentage in the battery widget while connected because other non-apple Bluetooth headphones don’t have that and I’m left guessing how much is left on the tiny control center icon with those.In sum, I HIGHLY recommend these if you’re looking for good bluetooth headphones and don’t have $400+ to spend. I snagged them for $99.95, and I couldn’t be happier. They’re definitely a good value at $200, but they’re mind blowing at a part-time, minimum wage budget. Almost every feature has been either mind blowingly fantastic, but those that aren’t are barely worth commenting on.Are they perfect? No. Should one expect perfection at this price? Absolutely not. I’d highly recommend buying if they’re in your budget!!!","timestamp":"Reviewed in the United States October 17, 2023","profile_id":"AH6FFZWTYTQH3JFZKOI4VDFSDWRA","is_verified":true,"helpful_count":439,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"},{"id":"R1MJ08QRWZKAK6","title":"5.0 out of 5 stars My Go-to Headset","author":"Amiyah Ogo","rating":5,"content":"After going through so many headsets during college I decided to get these ones. They are great for the price! Great headset for college students. However the only downside is they aren’t super comfortable to lay down in or sleep with, but still fit amazing, have great sound quality, auto connect to my devices with no issues. And also are very durable, I’ve dropped them multiple times and have had no issues after about 6 months of having them. 10/10 headset","timestamp":"Reviewed in the United States May 18, 2024","profile_id":"AFIJUR2VSHB22IMJLMDTASXNVQOQ","is_verified":true,"helpful_count":2,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"},{"id":"R2IQV1A1SCQDVZ","title":"5.0 out of 5 stars These headphones deserve the hype!","author":"Mariah Chapman","rating":5,"content":"At last I finally found the perfect wireless headphones!! I bought these back in November when they were on sale for Black Friday (only $80!) and wanted to give them a test period before I reviewed them. Here’s what I’ve experienced this far:Pros1. The sound quality is impeccable. Literally everything is so clear and crisp. Funny enough, to put it into perspective, I was watching a movie and did not notice faint background music until I put these headphones on.2. The battery life is great. For me, they last roughly 72 hours before I need to fully recharge them. With charging, it takes maybe 40 minutes to an hour to get back up to a full charge. Impressive3. They’re compact and foldable. You’d be surprised how many headsets don’t fold when you’re done using them but these are perfect if you need to travel.4. They can connect to anything! I connected them to the Bluetooth on my tv for the first time since I didn’t want to wake my roommate up at 2am and set up was easy and simple.5. Changing the volume or song is simple and easy.6. Not really a pro, just an opinion, but they are really cute and stylish.Cons:1. A lot of people were right about them hurting your ears after having them on for too long; maybe more than 4 hours of continuous wear. I wish the part that goes around your ears was a little bigger to minimize the discomfort, but nonetheless it’s not a huge deal.2. Don’t connect them to numerous things at once. For instance, I had these paired with my iPhone and laptop at the same time. When I turned on my laptop it disconnected from my iPhone automatically and vice versa. My suggestion, disconnect from the device you’re not using and only focus on one sole device at a time.3. I wish the charger came with a charging block instead of just a wire. If you don’t have an extra block make sure you get one.4. They are not 100% noise cancelling but it does block out a good amount of outside noise5. My only concern is that when you call someone or someone calls you there’s a weird echo in the background. Like every time you talk it sounds like you’re talking in a tunnel? Again not a big deal just something I’ve noticed.Overall, I’m really happy with this purchase and if you’re considering getting these just do it. I really needed them for studying purposes and they get the job done 100%.","timestamp":"Reviewed in the United States January 19, 2024","profile_id":"AHKIWC4UYPVHMRXYTTGAEA655Q2Q","is_verified":true,"helpful_count":139,"product_attributes":"Color: SilverStyle: Solo3Set: Without AppleCare+"},{"id":"RB86XLAVC3GP7","title":"5.0 out of 5 stars 10/10, would buy again","author":"Nala","rating":5,"content":"They fit really nice, only problem is they hurt after a prolonged (8 hours consecutively) of wear, great quality, almost soundproof, overall 5 stars. Connects great, no problems and the battery life is amazing. Could go a full 2 days with no recharge.","timestamp":"Reviewed in the United States May 14, 2024","profile_id":"AEA3T5GCVIVOIBO3Z2IHXI7F64HA","is_verified":true,"helpful_count":5,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"},{"id":"R2Z4K7Q4FQDJMI","title":"5.0 out of 5 stars Worth it","author":"kwine","rating":5,"content":"Coming from AirPod Pros, these are wonderful. The noise muffling is effective, the sound quality and base are great. I wear them to work out and they don’t slip off, even during burpees. I wear glasses and have a big head and they’re comfortable for hours before the pressure on the glasses arms hurts my ears a bit. If I could change anything, I’d make the earmuff part bigger, but that may just be personal preference. All in all, I recommend them. Good quality for a decent price.","timestamp":"Reviewed in the United States June 9, 2024","profile_id":"AHEIOV53ZFYIE7NQ5B2U236WK3GQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"},{"id":"R1T7HWPFEWQG4F","title":"4.0 out of 5 stars Immersive Sound and Stylish Design: A Review of Beats Solo3 Wireless On-Ear Headphones","author":"CMReviewer","rating":4,"content":"The Beats Solo3 Wireless On-Ear Headphones are a fantastic choice for anyone seeking high-quality sound and convenient wireless connectivity. From their sleek design to their impressive battery life, these headphones have quickly become a favorite accessory in my daily life.One of the standout features of the Beats Solo3 headphones is their immersive sound quality. Whether I'm listening to my favorite music, podcasts, or audiobooks, the audio is crisp, clear, and full-bodied, allowing me to fully immerse myself in the listening experience.The wireless connectivity is another major selling point for these headphones. Thanks to the Apple W1 headphone chip and Class 1 Bluetooth technology, pairing the headphones with my devices is seamless and hassle-free. Plus, with up to 40 hours of listening time on a single charge, I never have to worry about running out of battery during long commutes or flights.However, it's important to note that the ear covers on the Beats Solo3 headphones may not fully cover the ears, which can cause discomfort for those with sensitive ears. As someone who prefers over-ear headphones for this reason, I did notice some discomfort after extended periods of use.Overall, despite this minor issue, the Beats Solo3 Wireless On-Ear Headphones are an excellent choice for anyone in search of stylish, high-quality headphones with impressive sound and wireless convenience. Just be mindful of the ear cover size if you have sensitive ears.","timestamp":"Reviewed in the United States May 4, 2024","profile_id":"AHUPUXWKEITRCH5VBW4S7D33I7LA","is_verified":true,"product_attributes":"Color: Rose GoldStyle: Solo3Set: Without AppleCare+"},{"id":"R1SLLOFV53BSY","title":"5.0 out of 5 stars Love these.","author":"Bart","rating":5,"content":"I got my first pair in 2016 for free from Apple when I bought a computer with my student discount. I used them every day until sometime in 2023 when the overhead band snapped. So I bought these to replace them.I have a very small head and stretched earlobes. Most over ear head phones are way too big and fall off if I look down. Or they sit in a way that makes my plugs dig into the pressure point behind the ear lobe. These head phones do neither. They fit snug without hurting my hears, these are on ear not over the ear. They do start to ache if I wear them for several hours with my glasses on though, like if I’m on a flight for a long time. But I think that happens with most headphones.They have great base and are great for noise cancelling. They fully charge in about on hour. Maybe less.Definitely recommend if you’ve got a small head and shuffle to find headphones that stay on. If you’re a giant man with a giant head, don’t get these. They’ll be too small.","timestamp":"Reviewed in the United States May 27, 2024","profile_id":"AFM3O6PY6AYDORNPO4BIMBHD4TYQ","is_verified":true,"product_attributes":"Color: Rose GoldStyle: Solo3Set: Without AppleCare+"},{"id":"R19GXT39NQ7PIB","title":"5.0 out of 5 stars Very loud","author":"Vanessa R.","rating":5,"content":"I bought these for my grandson‘s birthday present and I can’t get him to take them off He wears them everywhere he go. They are very loud and clear. It has a great fit Easy to adjust and they do not hurt your ears. Great product.","timestamp":"Reviewed in the United States June 5, 2024","profile_id":"AGW7KBMOGHZIPTHVRCU7KXQSJLGQ","is_verified":true,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"},{"id":"R1GKNATBFRCI5B","title":"5.0 out of 5 stars Insane battery life","author":"Michael","rating":5,"content":"I might just be crazy but I can use these things for like 10+ hours a day and I only need to charge them once a week or so. And on top of that, they can charge from dead to full in like an hour or so. I'm sure there are products with better sound quality and noise canceling but for the low price and insane battery life they're definitely better than most other products ive seen.They're comfortable and easily adjusted, my only complaint is that they're fairly tight so it can hurt your ears after a few hours but that's bound to happen with any headphones.Overall great product, I've used them every day since I bought them and never once regretted my purchase.","timestamp":"Reviewed in the United States June 8, 2024","profile_id":"AF6CZPUOUWRIFXF4VB3VFLZGYCDA","is_verified":true,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"},{"id":"R1NPJGY6ZELSU","title":"4.0 out of 5 stars Perfect for running, ear pads a bit small","author":"M","rating":4,"content":"I run outdoors frequently and was looking for a decent pair of headphones because my area is noisy and I was tired of constantly adjusting my airpods while running. I wanted something with serviceable audio quality that I also wouldn't mind putting through the constant wear and tear of sweaty runs. I was previously wearing a more expensive pair of headphones to run, and while I do prefer those for use at home or for noise-canceling, they were too heavy and hot for running and I was worried about damaging them. The beats solo3 are a better fit for this particular use case (for me).Pros:- the apple bluetooth chip is extremely useful, it makes it so much more convenient to switch between devices! Major QOL improvement over other headphones I own- lightweight and don't make my ears hot during exercise- stay put well even with a lot of movement (I've even worn these while hanging upside down at the gym and they didn't fall off)- blocks out the perfect amount of sound for outdoor running, such that I'm not distracted by ambient noise but I still have enough situational awareness to hear a car honking at me at close range- audio quality is better than any of my in-ear headphones, which is really all I needed in this case- battery life is great, I never find myself running out of battery even though I use these quite a bitCons:- My primary reason for deducting a star: I was expecting these to be over-ear, but they're actually more like on-ear; the ear pads are a bit tight and sometimes they start to hurt my ears after wearing them for longer periods of time, usually after ~45 minutes (I'd be especially cautious if you have any cartilage piercings)- It's a bit hard to use the control buttons sometimes- the double tap to skip is a little finicky, sometimes if I press too quickly in succession or not hard enough it doesn't register. The volume controls are so much smaller and so far to the top and bottom, respectively, that I sometimes accidentally hit the center pause button instead. Still convenient to have controls there, but they have room for improvement. I also find myself wishing that I could use the controls from either side instead of just the one, but that's not a big deal.- I worry that the band might be damaging my hair a bit, as it's a pretty grippy material. It's not pulling out any hair, but I do wish it had a bit more slip since the headphones feel tight enough to stay put regardless","timestamp":"Reviewed in the United States February 25, 2024","profile_id":"AHMFDYUZPJZD6H4D22HIWLJNTG4A","is_verified":true,"helpful_count":14,"product_attributes":"Color: Rose GoldStyle: Solo3Set: Without AppleCare+"}],"page_type":"Question","asin_in_url":"B07YVYZ8T5","product_name":"Beats Solo3 Wireless On-Ear Headphones - Apple W1 Headphone Chip, Class 1 Bluetooth, 40 Hours of Listening Time, Built-in Microphone - Black","parse_status_code":12000},"created_at":"2024-07-06 09:54:50","updated_at":"2024-07-06 09:54:52","page":1,"url":"https://www.amazon.com/product-reviews/B07YVYZ8T5?reviewerType=all_reviews&pageNumber=1","job_id":"7215292100185711617","status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B07YVYZ8T5?reviewerType=all_reviews&pageNumber=2","asin":"B07YVYZ8T5","page":2,"pages":730,"reviews":[{"id":"R3BYFJCOW2IL0J","title":"4.0 out of 5 stars Nice battery life","author":"JasJas","rating":4,"content":"What I love most is the battery lasting of the headphones. I don’t like charging often and this is exactly what I need.Sound: It’s not completely noice canceling. But that’s not a problem for me.Audio quality is greatWhen u talking on zoom or phone call, it cancel out a lot of the outside noises.Easily connectable to different devicesConfort: first 2 weeks hurt my ears. But now I’m used to it and it feels ok on the ears. It’s on the ear instead of over the ears so wearing long time, can be quite uncomfortable.The quality is worth the price. I like it.","timestamp":"Reviewed in the United States June 24, 2024","profile_id":"AFISVQ64KLARED3BG4T5WEBW7BAA","is_verified":true,"product_attributes":"Color: Rose GoldStyle: Solo3Set: Without AppleCare+"},{"id":"R2ZY137E8H8FF3","title":"5.0 out of 5 stars In love with these Headphones","author":"H. Monroe","rating":5,"content":"I was so anxious about getting this because I wasn't sure if these would work because it doesn't say noise cancelling, which I absolutely prefer, HOWEVER, it does say SOUND ISOLATION. I was ready to send these back before I even gotten them. The sound is crisp and my ears aren't sweaty. I have BEATS \"over the ear\" earbuds, which are cool and this is my second pair. *heart*","timestamp":"Reviewed in the United States June 20, 2024","profile_id":"AED7Q5TRZZVVLBRTARCXHLXE7TCA","is_verified":true,"product_attributes":"Color: SilverStyle: Solo3Set: Without AppleCare+"},{"id":"RC8JCTPLXYXV8","title":"5.0 out of 5 stars The wife loves this headphone!","author":"abt13","rating":5,"content":"I bought this headphone for my wife. She seems to love it because when I try talking to her she completely ignores me, which is a testament for the noise canceling feature :).Kidding aside she likes it also for the gym because a lot of people go to the gym to talk more than exercising and the noise canceling feature works well. She also likes for the quality of the sound and how easily it connects with the bluetooth on her phone.","timestamp":"Reviewed in the United States June 13, 2024","profile_id":"AERRHECRU2YN5ICJSICNXPKV4UYA","is_verified":true,"product_attributes":"Color: Rose GoldStyle: Solo3Set: Without AppleCare+"},{"id":"RH1DPEZ7RQCP8","title":"5.0 out of 5 stars Beats","author":"Shaliyah","rating":5,"content":"Love my beats the durability is amazing all the buttons work. The stability is also great as well. It’s worth the money you spend on it. Love the performance of them they are loud and amazing!!!","timestamp":"Reviewed in the United States July 4, 2024","profile_id":"AEUFAGHKDZYJEOOKKF7OGN4SMVCA","is_verified":true,"product_attributes":"Color: Rose GoldStyle: Solo3Set: Without AppleCare+"},{"id":"RKPM3YBXPUWJ3","title":"5.0 out of 5 stars Best headphones for the value","author":"Eunice","rating":5,"content":"I have purchased many headphones in the past however, this is hands down the best I have owned. They are comfortable to wear exercising, at home, on walks, etc. The sound quality is excellent. The noise cancelling is outstanding. Volume control is easy.","timestamp":"Reviewed in the United States June 26, 2024","profile_id":"AH3W4Y6OANQXOQBWG67VCCVTSDNQ","is_verified":true,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"},{"id":"R2KHBT37ELR0L9","title":"5.0 out of 5 stars Worth it!","author":"Stephanie","rating":5,"content":"I love my beats. As a mom I find it difficult to splurge on myself sometimes but purchasing this headset was truly worth it. The volume exceeded my expectations and charges quickly. It might be that I use my headset here and there but if fully charged, the battery life lasts me a couple days. Great quality ,comes with a case and battery charger .","timestamp":"Reviewed in the United States June 16, 2024","profile_id":"AGMNDW772OEMPB35MLKX4TQAQGJQ","is_verified":true,"product_attributes":"Color: Rose GoldStyle: Solo3Set: Without AppleCare+"},{"id":"R3Q3AU935PAE2E","title":"4.0 out of 5 stars No Regrets","author":"Amazon Customer","rating":4,"content":"Bought these as my AirPods never quite had great sound quality and the difference has me on the floor. I literally have to stop what I'm listening to when people are talking to me as I can't hear what they're saying. I do see the point people make about pain on the ears, but that seems to have stopped as my ears have adjusted. My only complaint is my hair seems to easily wrap around the ear covers, so taking them off is sometimes a struggle.","timestamp":"Reviewed in the United States June 9, 2024","profile_id":"AFHZS3BG2AT7SBOXPXSSGRVFR7IQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Rose GoldStyle: Solo3Set: Without AppleCare+"},{"id":"RXOGSRUEQHADO","title":"4.0 out of 5 stars Beats Solo3 review","author":"Kara Kakes","rating":4,"content":"I’ve had them for about 3-4moths now.Set up and pairing with my smart phone was seamless and instructions were clear and easy to follow .Battery life is good, I use them twice weekly for about an hour at a time for telehealth visits. I have not had any problems with being heard or hearing who is speaking to me. Mic seems to work great! Sound is clear . I turn them off after every use and have not had to charge them yet.Pretty comfortable overall , I have worn them a few times for over an hour during hikes and walks outside. ( an hour and 45min at the most ) and found that my ears were slightly sore after that time frame but not painful at all.( I have not done any running in them)Lightweight and compact enough to take with me on the go-I didn’t like that I could not get them back into the small bag they came in easily. It seems to be a very tight fit to get them in and out even when they are collapsed fully so I have not been using the bag they came in for storage .Other than that they work great for my needs.","timestamp":"Reviewed in the United States April 10, 2024","profile_id":"AFDBDFGWMV6V4NKQXW3PFJ7RPVDQ","is_verified":true,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"},{"id":"R2H7EVHJYK7M0K","title":"4.0 out of 5 stars Fits good","author":"smiley","rating":4,"content":"These are great headphones. The fit is comfortable; oddly I have small ears and these seem a little small for my ears. At times, making my ears hurt. I like the appearance but wished I got a different color than the rose. When used, it really reduces the noise around you do you can relax. Connects well with my Apple phone. Charge does not drain fast. I have one pair for home and one for work when I walk. Price was right.","timestamp":"Reviewed in the United States June 6, 2024","profile_id":"AEAFNHL2IU6DXZEPN4VS63QYKT6Q","is_verified":true,"product_attributes":"Color: Rose GoldStyle: Solo3Set: Without AppleCare+"},{"id":"RWC4WKNDYXNFN","title":"5.0 out of 5 stars Kid approved","author":"Kristin","rating":5,"content":"We have bought many cheaper headphones for our kids, but they never last long and always break. Finally caved and purchased beats. They connect easy, and have a long battery life. Being wireless is an extra plus!","timestamp":"Reviewed in the United States June 22, 2024","profile_id":"AG3D7HMOZW3W46A5SAERZRPU6YGA","is_verified":true,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"}],"page_type":"Question","asin_in_url":"B07YVYZ8T5","product_name":"Beats Solo3 Wireless On-Ear Headphones - Apple W1 Headphone Chip, Class 1 Bluetooth, 40 Hours of Listening Time, Built-in Microphone - Black","parse_status_code":12000},"created_at":"2024-07-06 09:54:50","updated_at":"2024-07-06 09:54:53","page":2,"url":"https://www.amazon.com/product-reviews/B07YVYZ8T5?reviewerType=all_reviews&pageNumber=2","job_id":"7215292100185711617","status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B07YVYZ8T5?reviewerType=all_reviews&pageNumber=3","asin":"B07YVYZ8T5","page":3,"pages":730,"reviews":[{"id":"R29IAU5OCQX81L","title":"4.0 out of 5 stars Gifted","author":"LocQueen","rating":4,"content":"Gifted these to my boyfriend for his birthday. His other earphones were falling apart and hanging by the wire so these were a big upgrade for him. He really appreciated and enjoys using them especially when he's mixing beats. No complaints at all. He said the volume works great, flawless bluetooth connection, the bass is awesome. The noise cancelling feature works great as well. I walk up on him all the time without him noticing.","timestamp":"Reviewed in the United States June 10, 2024","profile_id":"AHLUHWNGNNC6FBGGYY7H6QILX4OA","is_verified":true,"product_attributes":"Color: RedStyle: Solo3Set: Without AppleCare+"},{"id":"R2MIT9EDS6JDPU","title":"5.0 out of 5 stars Love them!!!!!","author":"….","rating":5,"content":"Everything is excellent. Literally i use them all day. They last a lot without me needing me to charge them. I am so in love with them. Would recommend.","timestamp":"Reviewed in the United States June 26, 2024","profile_id":"AHTYBYRIXQAM5FM6RAB4TP36BDYA","is_verified":true,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"},{"id":"R1DHQMP53M5MI3","title":"5.0 out of 5 stars Great blue tooth product","author":"Robert Hudson","rating":5,"content":"The wife uses them on walks with her phone and audible books on her tablet","timestamp":"Reviewed in the United States June 29, 2024","profile_id":"AEOBFBBFPXR5UT2KGY6OBCPHWGJA","is_verified":true,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"},{"id":"R1QZRF5QC7ULQ0","title":"5.0 out of 5 stars Beats","author":"Lisa Fellman","rating":5,"content":"This was a gift and she loved them. Uses at the gym and when running.","timestamp":"Reviewed in the United States June 28, 2024","profile_id":"AHH3DDOMKKEYNHMUFKFXZMWDEDAQ","is_verified":true,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"},{"id":"R14BVLZC2Z74UV","title":"4.0 out of 5 stars Applecare","author":"Terri Bradley","rating":4,"content":"If you have trouble keeping electronics, highly recommend adding apple care. Noise canceling is good.","timestamp":"Reviewed in the United States July 4, 2024","profile_id":"AED7VR2KS2IGI47JIHDRSXGIT6TA","is_verified":true,"product_attributes":""},{"id":"R2Y42DTU3TIYMO","title":"5.0 out of 5 stars Been using these for over 10 years, a must purchase if noise cancellation irritates your ears.","author":"Indy","rating":5,"content":"I have sensitive ears that get bothered by noise cancellation, these do not have that and sound amazing. Lots of bass and quality audio. Easy connectivity to iphone, android and PC. I've been using these style of beats for over 10 years, they last a long time. The first pairs battery that I bought still works. Eventually the padding comes apart but it takes me 2 years of 4-5 hours of daily usage for it to even start.","timestamp":"Reviewed in the United States May 27, 2024","profile_id":"AF4OSLPZGE5EQB62AMT25PY5UJTA","is_verified":true,"helpful_count":1,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"},{"id":"R2WSBMQS6H61NW","title":"5.0 out of 5 stars I wear them every workout!","author":"Vivianna Ruth Mongin","rating":5,"content":"These are great and I got them on sale which was a pulse! I use them every workout and they do not fall off my head when I run! I also love the all black look! Would buy again!","timestamp":"Reviewed in the United States June 15, 2024","profile_id":"AGQAMWM7PIDDFRQ2VEBULBCXDFHA","is_verified":true,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"},{"id":"R2H3NFWQAIRNCA","title":"5.0 out of 5 stars great battery life","author":"harmony","rating":5,"content":"10/10 great battery life last up to 2.5 days. you can’t hear much with them on so i’d say they have good noise cancellation.","timestamp":"Reviewed in the United States June 26, 2024","profile_id":"AGZL2SD2T5HHSRVFPQOMAO5C2RHA","is_verified":true,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"},{"id":"R8ULWUTXFQZDU","title":"5.0 out of 5 stars Love them! Second Pair!","author":"Ariana","rating":5,"content":"Love these always, such a great price for quality headphones. They allow me to lock in while working out, the dont slide around on my head to much when I’m in motion and the carrying case makes it easy to toss in the gym bag. They hold a charge forever i work out about 5x a week for 1 1/2 hours - 2hours and only charge them once every two weeks! Only thing I’d say is kinda frustrating is that the microphone sucks (if it even has one) lmao so talking on the phone is kind of a hassle when using them.","timestamp":"Reviewed in the United States May 15, 2024","profile_id":"AH32SERNEVB7GMJPYGZXFU7WXJVA","is_verified":true,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"},{"id":"R3Q50Z06TTFK3A","title":"4.0 out of 5 stars good for the price","author":"Alexa yilmaz","rating":4,"content":"when on the phone and windy the other person can hear the wind","timestamp":"Reviewed in the United States July 2, 2024","profile_id":"AGZBQYHDILLTJ7QBLZ7UK7XW5P7Q","is_verified":true,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"}],"page_type":"Question","asin_in_url":"B07YVYZ8T5","product_name":"Beats Solo3 Wireless On-Ear Headphones - Apple W1 Headphone Chip, Class 1 Bluetooth, 40 Hours of Listening Time, Built-in Microphone - Black","parse_status_code":12000},"created_at":"2024-07-06 09:54:50","updated_at":"2024-07-06 09:54:54","page":3,"url":"https://www.amazon.com/product-reviews/B07YVYZ8T5?reviewerType=all_reviews&pageNumber=3","job_id":"7215292100185711617","status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B07YVYZ8T5?reviewerType=all_reviews&pageNumber=4","asin":"B07YVYZ8T5","page":4,"pages":730,"reviews":[{"id":"RZY069R4UIN7Q","title":"5.0 out of 5 stars Great sound- very comfortable on the ears","author":"Alaina Bolster","rating":5,"content":"I recently got my hands on the Beats Solo3 Wireless On-Ear Headphones, and I must say, I’m thoroughly impressed! The sound quality is top-notch, delivering crisp highs, deep bass, and balanced mids that make every song sound incredible. The wireless connectivity is seamless, allowing me to move around without being tethered to my device.What truly sets these headphones apart is their portability. The sleek design and foldable construction make them perfect for on-the-go use. Whether I’m commuting, working out, or just relaxing at home, these headphones are always by my side. Plus, the long battery life means I can enjoy my favorite tunes for extended periods without worrying about recharging.Overall, I highly recommend the Beats Solo3 Wireless On-Ear Headphones to anyone in search of premium sound quality and unmatched convenience. They’ve certainly exceeded my expectations, and I’m confident they’ll do the same for you!","timestamp":"Reviewed in the United States April 26, 2024","profile_id":"AHEZ4BMPZQDOL7NHCYCB7H3NLXIA","is_verified":true,"helpful_count":3,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"},{"id":"R2P3JRB3XRYY3I","title":"4.0 out of 5 stars the best headphones","author":"Angel","rating":4,"content":"The best headphones. I was looking for the perfect headphones with the qualities of sound cancellation , durability, color and comfortability and I found the perfect ones. How i even found out about this product is because one day i was working out at the gym with my cousin and i need music loud enough and my airpods was not loud enough for me so me and my cousin swapped and i was so satisfied with the loudness of it and i was so focused and encouraged to finish my workout. I really like these because of the sound cancellation mostly , when I am doing my school work working out and I don't want to hear anything I put these on and everything on the outside just goes mute and the headphones just do their job. In a lot of headphones I feel like the advertisement is really fake. As someone who has tried the majority of wireless headphones this one is probably one of my favorites so far. But I do have some dislikes and likes about this product starting off with the dislikes . first thing i would like to start of with is how big the headphones are like there so noticeable and there just there i wish there were smaller nad like airpods sort of another dislike is u could hear the music out the headphones loud and clear so it's like whatever your listing to others can hear which i honestly hate that. Next is that you can lay down with them like if u were laying down on your ear its just super uncomfortable because like i said on how big it is. Now let's move on to the like starting off with the ear muffs they put on the headphone . The earmuffs are what makes this product super comfortable and if it's cold your ears will be warm because of the earmuffs. Next is the loudness of course like i said in the beginning and the sound cancellation. Finally, I love how this product has multiple colors and they are all beautiful but the color I have is just out of this world which is the pink rose gold color love love love this color is just such a pretty color and it's my type of vibe. My honest review for the headphone is 4.8/5 these are great headphones and they have everything you need in them i just personally don't like hoe big and bulky they are and how you can hear the music outside the headphones but other than that love this product and i highly recommend you buy this for a friend or family member or even yourself if your looking for a headphone with noise cancellation and loudness to it .","timestamp":"Reviewed in the United States November 28, 2023","profile_id":"AEOW7ZE5YPXQQLYVVXAFJ5WKTXLA","is_verified":true,"helpful_count":15,"product_attributes":"Color: Rose GoldStyle: Solo3Set: Without AppleCare+"},{"id":"R14FM78E6SGF1N","title":"4.0 out of 5 stars Nice headphones, but not durable","author":"Jen","rating":4,"content":"had these about 8 months and they stopped working in one ear. Brought them to the Apple Store and they replaced them since they were within 1 year. had the replacement pair about 6 months and again, stopped working. So, ended up just replacing them with another brand. Nice headphones but not long lasting.","timestamp":"Reviewed in the United States June 5, 2024","profile_id":"AEHZWJ7IJOX6GUEWXS7WXSFNL5BQ","is_verified":true,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"},{"id":"RUB5O4PEU2112","title":"5.0 out of 5 stars not bad for the price","author":"amy w","rating":5,"content":"I’ve used Beats for some time- but not the headphones. The earbuds have been such a good investment for me so I figured I’d give the headphones a try. Purchased when it was on sale which I can’t complain about. The sound quality is pretty good, but the noise cancellation isn’t as good as the earbuds I’ve experienced. I work in an office where everyone is on a call and talking, so noise canceling is something I look for in a pair of headphones. It more so muffles the external noises but that’s all. The fit is snug which is good for working out, and the adjustability is easy to figure out. The colors are a nice touch to the appearance, but the best part is the charging aspect. One charge is good for a week of consistent use. Plus it doesn’t take long to charge either, which is great for anyone in a rush","timestamp":"Reviewed in the United States April 16, 2024","profile_id":"AEDGAFMHRDTDFKBHU5HFYTSNJRLA","is_verified":true,"helpful_count":1,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"},{"id":"R3I1PWT5UVU3UE","title":"4.0 out of 5 stars Headphones","author":"Kaylan Simmons","rating":4,"content":"Not as loud as I expected, but it does pretty well with cancelling noises. Fits to head and adjustable when needed. Comes with a charger and charges quick. Good quality.","timestamp":"Reviewed in the United States June 12, 2024","profile_id":"AF4CLX3WBTKOJUK4F2PZLCZF6S7A","is_verified":true,"product_attributes":"Color: Rose GoldStyle: Solo3Set: Without AppleCare+"},{"id":"R34Q4PNYU67HCC","title":"5.0 out of 5 stars Great for preteens","author":"Tnicholson","rating":5,"content":"My 11 year old wanted AirPods, but I knew they wouldn’t fit well in his ear canal (they don’t fit well in mine). Plus he is 11 and I was afraid he would lose them. These wireless over the ear option were a hit. They fit well, pair to any Bluetooth device, and charge quickly. They are excellent quality.","timestamp":"Reviewed in the United States May 27, 2024","profile_id":"AHLHSXMK6I2HLTHBQLR32VRIOO6Q","is_verified":true,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"},{"id":"R1ZGBL9RE847V3","title":"5.0 out of 5 stars High Quality","author":"Brian Reed","rating":5,"content":"Got these for my daughter who absolutely loves them. High quality and good durability!!!","timestamp":"Reviewed in the United States June 19, 2024","profile_id":"AE4XAIA7OOYZF2UOY3543SVRWEZA","is_verified":true,"product_attributes":"Color: Rose GoldStyle: Solo3Set: Without AppleCare+"},{"id":"R2P2SDXR960XY9","title":"5.0 out of 5 stars Good sound","author":"Derayshail","rating":5,"content":"Works well and great sound","timestamp":"Reviewed in the United States June 26, 2024","profile_id":"AFOSMJN5LXGI3ELYYVRTBQOCTOZA","is_verified":true,"product_attributes":"Color: Rose GoldStyle: Solo3Set: Without AppleCare+"},{"id":"R1QBK7BV3TASRD","title":"5.0 out of 5 stars Love them","author":"I love this.. it’s last all day I always have people ask what do I have on and where did I get it from..","rating":5,"content":"My son-in-law is in love with his, I got them for him as a Press it and he loves him, was looking for black one but they was out of stock at the time but I end up getting him the red but it ended up be his favorite color and he loves him","timestamp":"Reviewed in the United States May 27, 2024","profile_id":"AFFKJ5O3TJADT42EFN5LQIEEQP4A","is_verified":true,"product_attributes":"Color: RedStyle: Solo3Set: Without AppleCare+"},{"id":"R3EZN4PK66XJLI","title":"5.0 out of 5 stars Beats","author":"Tammy Schmiedel","rating":5,"content":"Purchased as a Christmas gift for my daughter, great quality","timestamp":"Reviewed in the United States June 20, 2024","profile_id":"AG236UYJ3FES7CSSXRG6J2KHILWA","is_verified":true,"product_attributes":"Color: Rose GoldStyle: Solo3Set: Without AppleCare+"}],"page_type":"Question","asin_in_url":"B07YVYZ8T5","product_name":"Beats Solo3 Wireless On-Ear Headphones - Apple W1 Headphone Chip, Class 1 Bluetooth, 40 Hours of Listening Time, Built-in Microphone - Black","parse_status_code":12000},"created_at":"2024-07-06 09:54:50","updated_at":"2024-07-06 09:54:55","page":4,"url":"https://www.amazon.com/product-reviews/B07YVYZ8T5?reviewerType=all_reviews&pageNumber=4","job_id":"7215292100185711617","status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B07YVYZ8T5?reviewerType=all_reviews&pageNumber=5","asin":"B07YVYZ8T5","page":5,"pages":730,"reviews":[{"id":"R3AWK2ZYKTC8IA","title":"5.0 out of 5 stars Nuce","author":"Nique Foster","rating":5,"content":"I loved them but my dog chewed them up😞","timestamp":"Reviewed in the United States June 23, 2024","profile_id":"AFULLMADMT3J4ISVS3RNJ2ICFAWQ","is_verified":true,"product_attributes":"Color: Rose GoldStyle: Solo3Set: Without AppleCare+"},{"id":"RAN18EP5JNXVC","title":"4.0 out of 5 stars i really liked this but..","author":"Rochelle","rating":4,"content":"so cute and they feel okay after the first two hours of wearing them. It’s just that they’re so tight! like after two hours they really start to hurt my head and i have a small head!","timestamp":"Reviewed in the United States June 2, 2024","profile_id":"AEAIZTQ4JXUKIODAR6OWS444J4ZA","is_verified":true,"product_attributes":"Color: SilverStyle: Solo3Set: Without AppleCare+"},{"id":"R1GV960PHRSA9H","title":"5.0 out of 5 stars The Volume settings is absolutely amazing","author":"Neviah Hall","rating":5,"content":"I love like not hearing when people are talking to me or when my social battery just died and I want to be to myself so these beats definitely help me zone out and focus on whatever I’m listening to definitely recommend buying this product","timestamp":"Reviewed in the United States May 27, 2024","profile_id":"AGA3VH5UN7XV2WY5YIXWZLZ5EAIQ","is_verified":true,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"},{"id":"R1E4DAO1Y5M41L","title":"5.0 out of 5 stars excellent!!!","author":"broadwayhoofer","rating":5,"content":"excellent product.... i didn't want to replace my aging earphones, because i thought i could not get better ...was i wrong!!!!!these headphones are far, far, superior, in every way. Excellent clear balanced sound and more thanks!!!","timestamp":"Reviewed in the United States May 23, 2024","profile_id":"AGZDZ2OFRLYF6GO3BITVGIKWKZWQ","is_verified":true,"product_attributes":"Color: RedStyle: Solo3Set: Without AppleCare+"},{"id":"R1HHICNF3G3PPA","title":"5.0 out of 5 stars Love them!","author":"Living the Life!","rating":5,"content":"I had to give up my earbuds as they don't fit comfortably in my ears. Got these and the sound is superb!","timestamp":"Reviewed in the United States June 1, 2024","profile_id":"AEHUH4MXMN7LBG4EATQXNIRASI6A","is_verified":true,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"},{"id":"R3SHA9OMSAEAU1","title":"5.0 out of 5 stars Great purchase!","author":"Katie","rating":5,"content":"Battery life is great. Sound is great. Cant tell they are refurbished. Will definitely use this company again for other purchases","timestamp":"Reviewed in the United States June 2, 2024","profile_id":"AHMDGVDAEFVKRJBKX4QZKXWMUZTA","is_verified":true,"product_attributes":"Color: SilverStyle: Solo3Set: Without AppleCare+"},{"id":"RRNVHOAWECQOR","title":"4.0 out of 5 stars Pretty","author":"Des","rating":4,"content":"These headphones was really pretty, but wasn’t that loud and I think they wasn’t the original beats","timestamp":"Reviewed in the United States June 6, 2024","profile_id":"AEP3W267KJI4VR2G4ND6E4CGYBFA","is_verified":true,"product_attributes":"Color: Rose GoldStyle: Solo3Set: Without AppleCare+"},{"id":"R1QS8MDL4MQ1GR","title":"4.0 out of 5 stars Good headphones","author":"Spindly","rating":4,"content":"Good headphones, they are the lower end so don’t have the noise cancellation, but are great for the price.Shipping did seem to take extremely long, not too sure why they sat around for so long before shipping. May have just been awaiting large order to ship out, but seemed like Beats took a while.","timestamp":"Reviewed in the United States May 6, 2024","profile_id":"AF6IXQTAC5PSBVAVOMMD4GG2T32A","is_verified":true,"product_attributes":"Color: Rose GoldStyle: Solo3Set: Without AppleCare+"},{"id":"R3KMG3ZFRO47IR","title":"5.0 out of 5 stars Excelente compra","author":"Carmen","rating":5,"content":"Muy bien equipo","timestamp":"Reviewed in the United States June 16, 2024","profile_id":"AETYGPET622XKAPSWFL5W4KXKL4A","is_verified":true,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"},{"id":"R170FVAREYNE9Q","title":"5.0 out of 5 stars Love it","author":"Latavia","rating":5,"content":"I don’t move without them. Great sound, no problems with connectivity. Size is great and I got the color black.","timestamp":"Reviewed in the United States June 9, 2024","profile_id":"AF2Y47FVJJI6TRFG5TI52J3LSIVQ","is_verified":true,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"}],"page_type":"Question","asin_in_url":"B07YVYZ8T5","product_name":"Beats Solo3 Wireless On-Ear Headphones - Apple W1 Headphone Chip, Class 1 Bluetooth, 40 Hours of Listening Time, Built-in Microphone - Black","parse_status_code":12000},"created_at":"2024-07-06 09:54:50","updated_at":"2024-07-06 09:54:56","page":5,"url":"https://www.amazon.com/product-reviews/B07YVYZ8T5?reviewerType=all_reviews&pageNumber=5","job_id":"7215292100185711617","status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B07YVYZ8T5?reviewerType=all_reviews&pageNumber=6","asin":"B07YVYZ8T5","page":6,"pages":730,"reviews":[{"id":"R3K3B9L7X6PVBK","title":"5.0 out of 5 stars Super","author":"Luis","rating":5,"content":"Calidad excepcional","timestamp":"Reviewed in the United States June 15, 2024","profile_id":"AFAEXQMQGFTWSGDIW6FW4LY4AGKQ","is_verified":true,"product_attributes":"Color: Rose GoldStyle: Solo3Set: Without AppleCare+"},{"id":"RWAWWHNPITXJD","title":"4.0 out of 5 stars Unmatched Style and Performance","author":"Eric W.","rating":4,"content":"I recently purchased the Beats Solo3 Wireless On-Ear Headphones, and I must say, they have left a lasting impression on me. From their sleek design to impressive sound quality and long-lasting battery life, these headphones have become my constant companion for both daily commutes and intense workout sessions.First and foremost, the design of the Beats Solo3 headphones is striking. The sleek and streamlined appearance, combined with the iconic Beats logo, exudes a sense of modernity and style. The headphones come in a variety of attractive colors, allowing users to express their personality and preferences. The on-ear design is comfortable and snug, providing a secure fit that stays in place even during vigorous activities.The sound quality is undeniably excellent. The Beats Solo3 headphones deliver a powerful and bass-heavy sound signature that suits various music genres. The bass response is deep without overpowering the vocals and trebles, resulting in an immersive audio experience. Whether I'm listening to my favorite tracks, watching movies, or playing games, the headphones never fail to impress with their rich and dynamic sound.The wireless connectivity is a game-changer. Pairing the Beats Solo3 with my devices is effortless, thanks to the Apple W1 chip. The Bluetooth connection remains stable and reliable, allowing me to move around without any dropouts. Additionally, the on-ear controls are intuitive and easy to use, enabling me to adjust the volume, skip tracks, and answer calls with a simple tap.The battery life of the Beats Solo3 headphones is outstanding. With up to 40 hours of playback on a single charge, I rarely have to worry about running out of power during extended use. Moreover, the Fast Fuel feature is incredibly handy, providing three hours of playback after just a 5-minute charge, perfect for those last-minute situations.The headphones also feature a built-in microphone, which works well for making calls and using voice assistants like Siri. However, the microphone's performance in noisy environments could be improved, as it tends to pick up background noise.Comfort-wise, the on-ear design may not be suitable for everyone, especially during prolonged wear. Some users might experience slight discomfort or ear fatigue after extended use, but this can be alleviated by adjusting the fit and taking short breaks.While the Beats Solo3 Wireless On-Ear Headphones deliver impressive sound quality and wireless convenience, the premium price tag might be a deterrent for some budget-conscious consumers. However, the product's performance and brand reputation are likely to justify the investment for audiophiles and fans of the Beats brand.In conclusion, the Beats Solo3 Wireless On-Ear Headphones are a stylish and reliable choice for music enthusiasts seeking powerful sound and seamless wireless functionality. With a few minor improvements in comfort and microphone performance, these headphones could easily score a perfect rating. If you prioritize style, sound quality, and long-lasting battery life, the Beats Solo3 headphones won't disappoint.","timestamp":"Reviewed in the United States July 24, 2023","profile_id":"AH6BBFPUMBAE5YUGOFBLLM7KBGLQ","is_verified":true,"helpful_count":86,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"},{"id":"R1JACMQNQTT59A","title":"5.0 out of 5 stars son loves it","author":"paul echevarria","rating":5,"content":"bought this for our son 6 mos ago and he uses it all the time including at the gym. great quality product.","timestamp":"Reviewed in the United States June 8, 2024","profile_id":"AHQK6IVJJ5GC52KJRQHO4ZZQVASA","is_verified":true,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"},{"id":"R18ENKSHLNW144","title":"5.0 out of 5 stars 👍","author":"Amazon Customer","rating":5,"content":"👍","timestamp":"Reviewed in the United States June 23, 2024","profile_id":"AEE2PTKNCLE6SGUGK5FSONKVPGSQ","is_verified":true,"product_attributes":"Color: SilverStyle: Solo3Set: Without AppleCare+"},{"id":"R1AGTUGPOS1WDZ","title":"5.0 out of 5 stars My son loves them","author":"Melinda Howie","rating":5,"content":"My son loves these headphones, he’s satisfied.","timestamp":"Reviewed in the United States June 13, 2024","profile_id":"AEBOSCXXZDLZPN4HJJFY7GQDXH3Q","is_verified":true,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"},{"id":"RDUX3GNBWNN8S","title":"5.0 out of 5 stars ⭐️⭐️⭐️⭐️⭐️","author":"Janelle","rating":5,"content":"I love them. They last about 3 weeks charged and sound really good. I use them for the gym so the sweat has ruined the ear covers a little but overall really good 👍.","timestamp":"Reviewed in the United States May 26, 2024","profile_id":"AET2ZJ7ZAYAQIDTXW5JSVCORNYAA","is_verified":true,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"},{"id":"R1IHW120A84Q7F","title":"5.0 out of 5 stars Beeps","author":"Justin Harris","rating":5,"content":"Best headphone i ever bought.","timestamp":"Reviewed in the United States June 18, 2024","profile_id":"AEU6TY7CTKXJWYKT33Q4Y445K3HQ","is_verified":true,"product_attributes":"Color: Rose GoldStyle: Solo3Set: Without AppleCare+"},{"id":"RCBFP6GVA5MNU","title":"5.0 out of 5 stars Bought to replace older 1","author":"Tammt","rating":5,"content":"These headphones are amazing. Love the new matte look. 10/10 for sound quality, look, feel, noise cancellation, connectivity. Beats are just awesome.","timestamp":"Reviewed in the United States May 28, 2024","profile_id":"AFM75LUT422AX4N7EIDBPUV4QJ6A","is_verified":true,"helpful_count":1,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"},{"id":"R3V8N5D0S79CZL","title":"5.0 out of 5 stars Comfort","author":"jolie","rating":5,"content":"This product is perfect size for my head, so comfy by not making my ears hurt after long hours of use, and great quality sounds.","timestamp":"Reviewed in the United States May 31, 2024","profile_id":"AHU27OMHMOVA3DR5YRT7KUTTKZAQ","is_verified":true,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"},{"id":"R1QFH13GIKD0KV","title":"4.0 out of 5 stars It is ok","author":"Emilee","rating":4,"content":"The head phones are a little tight around my ears. But they are still great to use in the gym and going on walks.","timestamp":"Reviewed in the United States May 27, 2024","profile_id":"AEFOSNWCFXBGDX2ED2WK7EYU4NQQ","is_verified":true,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"}],"page_type":"Question","asin_in_url":"B07YVYZ8T5","product_name":"Beats Solo3 Wireless On-Ear Headphones - Apple W1 Headphone Chip, Class 1 Bluetooth, 40 Hours of Listening Time, Built-in Microphone - Black","parse_status_code":12000},"created_at":"2024-07-06 09:54:50","updated_at":"2024-07-06 09:54:57","page":6,"url":"https://www.amazon.com/product-reviews/B07YVYZ8T5?reviewerType=all_reviews&pageNumber=6","job_id":"7215292100185711617","status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B07YVYZ8T5?reviewerType=all_reviews&pageNumber=7","asin":"B07YVYZ8T5","page":7,"pages":730,"reviews":[{"id":"R2SJUFKWP3L8HL","title":"5.0 out of 5 stars Awesome","author":"I am very upset because I ordered the number 51 . I received number 71 . This is for my birthday TOMORROW.Can you please send the right number to me?","rating":5,"content":"Great","timestamp":"Reviewed in the United States June 20, 2024","profile_id":"AGYTA75ZWL43TBFBHXHGYAYXQZKA","is_verified":true,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"},{"id":"R14I0J1YA8UMMZ","title":"5.0 out of 5 stars Great sound quality","author":"Curtis","rating":5,"content":"Sound quality and battery life so far have been great.","timestamp":"Reviewed in the United States June 5, 2024","profile_id":"AHQO6PQGFQ37LFIKFXUANKTBLUXA","is_verified":true,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"},{"id":"R3JA67DOOKCOH7","title":"5.0 out of 5 stars AMAZINGGGG","author":"Shelovess._cxleb","rating":5,"content":"","timestamp":"Reviewed in the United States June 14, 2024","profile_id":"AEHGKJYWGQXDB5NIRH2MGNSUU7GQ","is_verified":true,"product_attributes":"Color: SilverStyle: Solo3Set: Without AppleCare+"},{"id":"R2W9XTTMWNNZKA","title":"4.0 out of 5 stars No speaker for phone calls","author":"TamTam","rating":4,"content":"Nice for listening to music or audible books but you cannot talk on the phone with them, the sound is terrible.","timestamp":"Reviewed in the United States May 14, 2024","profile_id":"AHKR7UTED3FSSO32EJAAUJAIAKMQ","is_verified":true,"product_attributes":"Color: Rose GoldStyle: Solo3Set: Without AppleCare+"},{"id":"R3M37Y949W6YSO","title":"4.0 out of 5 stars Great value","author":"JD","rating":4,"content":"I got these for a great price and they do the job. However I felt they were a little uncomfortable on my ears, so I ended up getting the Studio Pro’s instead to replace them.","timestamp":"Reviewed in the United States April 2, 2024","profile_id":"AHP4BL3TYSJL4RDVNNWIGQ66OWBA","is_verified":true,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"},{"id":"R2TOBJXOU2C0FQ","title":"4.0 out of 5 stars Beats are overpriced for reputations sake","author":"Joshua Huff","rating":4,"content":"I like the headphones; they’re nice, but they aren’t worth the money. The fit is small and uncomfortable. The sound quality is great, not perfect. Physical quality is nice. I like the buttons on the side.I don’t like that they are $130… they are so uncomfortable on my large head. I can only wear for 30 minutes before my ears start hurting. More worth $99.99","timestamp":"Reviewed in the United States April 20, 2024","profile_id":"AEYTKIIOMIMPCIR7WI3ATNQYTLUQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"},{"id":"R15WTFDHPNCU2N","title":"3.0 out of 5 stars Little ears","author":"Amazon Customer","rating":3,"content":"A. The ears on these are tiny.B. Don't wear earrings, they're tight.C. Don't wear your hair down, you'll lose some of it. It's really annoying, and painful.D. They do slip and move when I workout. I can walk on the treadmill, but anything else causes them to slip. E. Controls are only on one side, power button is tiny (so you'll have to turn it on before you put them on)Other than these issues, they do a good enough job keeping the outside noise out and the sound is Beats quality- if you're a Beats user. If you're not, it's a surround sound that's even and with enough base to feel empowered not jolted or rattled. And the battery lasts as long as advertised, even after a few months of regular use.","timestamp":"Reviewed in the United States May 26, 2024","profile_id":"AHBA5NB6TVWPPQ32PTNKOZOSU37Q","is_verified":true,"product_attributes":"Color: Rose GoldStyle: Solo3Set: Without AppleCare+"},{"id":"R17XESL5S3R98W","title":"5.0 out of 5 stars I LOVE THESE!!","author":"brooke samuelson","rating":5,"content":"I misplaced my airpods, thought I lost them, and purchased these to replace them. Airbuds hurt my ears and so i opted for these. They work great and i use them all of the time at the gym and when traveling. The battery life is fantastic as well as the sound quality. I highly recommend beats as they are affordable but very nice quality.","timestamp":"Reviewed in the United States May 11, 2024","profile_id":"AHQBBFNFGLK2QFOAKF6S7VCCTASA","is_verified":true,"helpful_count":4,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"},{"id":"R2BSG4UUVMY6CC","title":"4.0 out of 5 stars Good for the price","author":"Rebecca Woodard","rating":4,"content":"This is the first time purchasing beats headphones and the first thing I would say is the sound quality is really good for the price! They hurt my ears if they’re on for a long period of time but that’s usually how it goes for headphones. I will say that one small complaint I have is that my hair keeps getting pulled out due to strands getting stuck in the opening on the sides so it results in me having to carefully pull them out or they’ll get pulled. Another small complaint is that people can hear the music you’re listening to if you have it on high volume, but I tend to listen to music on high volume so that could be a me issue. Other than that I’m satisfied with the headphones and the sound quality and price is very agreeable :)","timestamp":"Reviewed in the United States March 2, 2024","profile_id":"AHSBGKKIP4UDGIBF7Y7ROTSVKWBQ","is_verified":true,"helpful_count":2,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"},{"id":"R2H5KXV3T5RMCV","title":"5.0 out of 5 stars Great Headphones","author":"Shannon Fuller","rating":5,"content":"It’s works really good","timestamp":"Reviewed in the United States June 7, 2024","profile_id":"AFY254WQ4VNZW7V3OMPZIZD5DFNQ","is_verified":true,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"}],"page_type":"Question","asin_in_url":"B07YVYZ8T5","product_name":"Beats Solo3 Wireless On-Ear Headphones - Apple W1 Headphone Chip, Class 1 Bluetooth, 40 Hours of Listening Time, Built-in Microphone - Black","parse_status_code":12000},"created_at":"2024-07-06 09:54:50","updated_at":"2024-07-06 09:54:58","page":7,"url":"https://www.amazon.com/product-reviews/B07YVYZ8T5?reviewerType=all_reviews&pageNumber=7","job_id":"7215292100185711617","status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B07YVYZ8T5?reviewerType=all_reviews&pageNumber=8","asin":"B07YVYZ8T5","page":8,"pages":730,"reviews":[{"id":"R1ALSL5KAKE2W","title":"5.0 out of 5 stars My granddaughter","author":"Piccachu","rating":5,"content":"She loved them","timestamp":"Reviewed in the United States June 3, 2024","profile_id":"AERM6MSCHIM2EHXTFZ5B7SMJMX4Q","is_verified":true,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"},{"id":"R3DDRDY7INRKFB","title":"4.0 out of 5 stars Great product mostly","author":"Christopher Stanley","rating":4,"content":"Since I bought these they have worked pretty well. Only issue I have encountered is after connecting with the aux cable and disconnecting it the right side doesn’t have sound. Then take the aux chord and put in and pull out a few times seems to resolve the issue.They are great as long as I do t connect with aux cable.","timestamp":"Reviewed in the United States March 18, 2024","profile_id":"AETJB5OT6UHXWMY3QDRJS4YHBKPQ","is_verified":true,"product_attributes":"Color: Rose GoldStyle: Solo3Set: Without AppleCare+"},{"id":"R2UHV3YMJYKPO8","title":"5.0 out of 5 stars Wife loves these","author":"K.S","rating":5,"content":"Got these for the wife . She wont wear anything else she loves the sound , comfort , battery time on these .","timestamp":"Reviewed in the United States May 23, 2024","profile_id":"AFP7QZRGBLLX4PY42T4SMN53MV5Q","is_verified":true,"product_attributes":"Color: Rose GoldStyle: Solo3Set: Without AppleCare+"},{"id":"R3AF4VY5MYRV2R","title":"5.0 out of 5 stars Good product","author":"jsg","rating":5,"content":"Granddaughter loved them","timestamp":"Reviewed in the United States June 8, 2024","profile_id":"AH3PKJHLBL26HF2E2AGVE3BJ6TSA","is_verified":true,"product_attributes":"Color: Rose GoldStyle: Solo3Set: Without AppleCare+"},{"id":"R5D7YS0D09PB3","title":"5.0 out of 5 stars Beats!!!","author":"Michael B","rating":5,"content":"My daughter LOVES them!! The sound the look, the fit, and quality!!","timestamp":"Reviewed in the United States May 27, 2024","profile_id":"AGREKQFND4GBGMEEA4LR6JSCP6WA","is_verified":true,"product_attributes":"Color: Rose GoldStyle: Solo3Set: Without AppleCare+"},{"id":"R2RAY6TSYGNK51","title":"5.0 out of 5 stars Best of 3 in comparison","author":"Paul Ratzlaff","rating":5,"content":"I bought these flash sale for $41 versus the list price of 59.99 and compared it to the Raycon every day headphones which listed for 99.99 and I got through Black Friday sale for 69.99 and found the Raycons Had a better feel. The Life Q 20s had to be played with full volume on the phone did not connect automatically to Bluetooth like the Raycon did and they were not water resistant like the Raycons were. The Raycons had a more in-depth base about it and I liked the way the Raycons Told you that it was connected to the Bluetooth when you first put them over your ears. I could feel the sound better with the Raycons. The soundcore, Life Q 20s did not connect automatically and just gave you a series of bleeps to let you know it was connected. So construction wise and convenience wise and sound wise I found the Raycons better. I then compared the Raycons to a pair of beats solo3 which listed for 199 and you can get them at Costco in black for $99 which is what I paid for them in an Amazon cyber Monday sale. The sound quality of the beats solo3 was by comparison Superior to even the Raycons. If you set your phone volume to high, you can still adjust the beats up or down without it affecting the volume on your phone, whereas both the Raycon and the soundcore when you increase or decrease the volume it would increase or decrease it on your phone . I returned this product and spent the little extra money for the beats solo3 and am happy. But if you’re looking for a good sound for under 50 bucks the soundcore life Q20 is very good. For a price between 50 and 100 the Raycon fit the category and was great, and if you’re not afraid to spend the extra bucks, the beats solo3 is the best.","timestamp":"Reviewed in the United States November 27, 2023","profile_id":"AFDUE4P2K26EO2ZHXFVG4TUTJRGQ","is_verified":true,"helpful_count":14,"product_attributes":"Color: SilverStyle: Solo3Set: Without AppleCare+"},{"id":"R3H4FUJX4PEYP5","title":"5.0 out of 5 stars Great sound, light in weight.","author":"nancy","rating":5,"content":"I was reluctant to purchase this item. When I received and used it I was thrilled. Great sound outdoors.","timestamp":"Reviewed in the United States May 30, 2024","profile_id":"AEHPWGLCNNXX2FIIZZFABSRB23MA","is_verified":true,"product_attributes":"Color: RedStyle: Solo3Set: Without AppleCare+"},{"id":"R1QKURTNVQO92W","title":"5.0 out of 5 stars Love everything","author":"julie","rating":5,"content":"Color, fit, battery life, sound. All worth the money","timestamp":"Reviewed in the United States May 27, 2024","profile_id":"AGGYT42EFKM7Q4Y23L522HMHPCDA","is_verified":true,"product_attributes":"Color: Rose GoldStyle: Solo3Set: Without AppleCare+"},{"id":"R18NASLCKJ0UXQ","title":"5.0 out of 5 stars Awesome!","author":"Shelley B","rating":5,"content":"My husband uses these and absolutely loves them. Very comfortable, easy to store. Quality is phenomenal, and very easy to connect through Bluetooth. We tried several pairs, but landed on this one, would highly recommend.","timestamp":"Reviewed in the United States May 15, 2024","profile_id":"AEQZ45LZM5AC4WOLSJHGA4MS7V3A","is_verified":true,"helpful_count":1,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"},{"id":"R1IFOHPG1MAC6C","title":"4.0 out of 5 stars Only Negative: Hurts Ears","author":"Karizma The Model","rating":4,"content":"I love my Beats headphones. I think it’s a great upgrade and musical experience. The quality is top notch and it automatically connects to my iPhone and Apple TV. Only negative is that the headphones are tight. The discomfort isn’t noticeable at first, but the more you wear them the more you feel the discomfort. I would still recommend them to family and friends.","timestamp":"Reviewed in the United States March 19, 2024","profile_id":"AGYXC5MZKCJ3J5U2OP7BPB564SUQ","is_verified":true,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"}],"page_type":"Question","asin_in_url":"B07YVYZ8T5","product_name":"Beats Solo3 Wireless On-Ear Headphones - Apple W1 Headphone Chip, Class 1 Bluetooth, 40 Hours of Listening Time, Built-in Microphone - Black","parse_status_code":12000},"created_at":"2024-07-06 09:54:50","updated_at":"2024-07-06 09:54:59","page":8,"url":"https://www.amazon.com/product-reviews/B07YVYZ8T5?reviewerType=all_reviews&pageNumber=8","job_id":"7215292100185711617","status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B07YVYZ8T5?reviewerType=all_reviews&pageNumber=9","asin":"B07YVYZ8T5","page":9,"pages":730,"reviews":[{"id":"R3TI36DXSKRHZM","title":"5.0 out of 5 stars Excellent Cordless Headphones for and Productivity","author":"Shopsmart","rating":5,"content":"I recently purchased the Beats Cordless Headphones and I must say, they have exceeded my expectations in terms of convenience and functionality. It has truly enhanced my overall experience and improved my quality of life.One of the standout features of these headphones is their compact design, making them easy to carry around. Whether I'm traveling or on the go, I can simply put them in my bag or pocket without any hassle. This portability allows me to have my headphones with me at all times, ensuring that I never miss out on an opportunity to absorb valuable material.Setting up the connection with these headphones is a breeze. The seamless Bluetooth connectivity ensures that I can quickly and effortlessly pair them with my devices. I appreciate the simplicity and reliability of the connection, as it saves me time and eliminates the frustration often associated with complicated setups.What I truly love about these headphones is the privacy they provide. With their excellent noise-canceling feature, I can immerse myself in my studies or work without any distractions. This privacy enables me to absorb more material effectively, leading to increased productivity. Moreover, I can enjoy my favorite music or podcasts without disturbing those around me, allowing me to create a peaceful environment wherever I go.The benefits of using the Beats Cordless Headphones are numerous. Not only do they enhance my learning and work capabilities, but they also provide me with more quality time. With these headphones, I can utilize my time more efficiently and make the most out of every moment.In conclusion, I highly recommend the Beats Cordless Headphones to anyone seeking convenience, functionality, and an improved quality of life. Its compact design, effortless connectivity, and privacy features make it a perfect companion for individuals who value productivity and personal time. Invest in these headphones, and you'll experience a significant positive impact on your daily routine and overall satisfaction.","timestamp":"Reviewed in the United States December 5, 2023","profile_id":"AH72TYZIQNDSDOUFUVR2GYKCL27Q","is_verified":true,"helpful_count":18,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"},{"id":"R29KJAQ3X28T5D","title":"4.0 out of 5 stars Overrated item","author":"Jenny","rating":4,"content":"Sound quality is great but the headphones aren’t durable. They are flimsy now and there is no noise cancellation which would have been a great addition.","timestamp":"Reviewed in the United States April 14, 2024","profile_id":"AGXFQLVGKF64PGC4PGKH4WIL46AQ","is_verified":true,"product_attributes":"Color: RedStyle: Solo3Set: Without AppleCare+"},{"id":"R35TMWI9TV7NQ6","title":"5.0 out of 5 stars Great for the gym/travel","author":"Emily White","rating":5,"content":"I ordered the black solo beats 3 for my 14 year old son so he can listen to music on the road while traveling for sports. The quality is great. He loves them. They are very easy to pair with his phone and fit perfectly in his book bag. My son enjoys the headphones more rather than the ear buds because they hurt the inside of his ears. He doesn’t leave home without them.","timestamp":"Reviewed in the United States April 1, 2024","profile_id":"AHUDMHHA3ZEHZ25GLOQ44PSYSVYQ","is_verified":true,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"},{"id":"R18SYH8M0MNZTT","title":"4.0 out of 5 stars Great Headphones but some cons.","author":"Amazon Customer","rating":4,"content":"These beats are really great and the adjustable thing on the top really lets them fit nice on your head. And the sound quality is actually amazing. On top of that, beats and apple have some sort of connected/deal (idrk) and because of this, when you turn them on, they automatically pair directly to your iPhone (I have a 14) and don’t make you go thru any annoying pairing process every time. They also directly show the beats icon, connection, and battery life directly on your iPhone. You also get a free month trial of Apple music plus. My only issue is that the ear part that surrounds your ear is rather small, so this may be an issue, and it is for me. After a while, my ears kinda begin to feel annoyed or hurt because it is not encompassing my full ear, so I feel that either the price of them, they could maybe have made them a little bigger. And the travel case is also pretty small and tight. I am pretty sure beats has a more expensive and different option that does fully surround your ear but it’s pretty pricey. Overall these are great and easy to use headphones.","timestamp":"Reviewed in the United States January 20, 2024","profile_id":"AGQSAINEOWRMNFUFUMHQMLSOJJHQ","is_verified":true,"helpful_count":16,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"},{"id":"R3S9AILJ7PEE6Q","title":"5.0 out of 5 stars i love my beats","author":"alore","rating":5,"content":"definitely loud ! they work amazing definitely worth your money","timestamp":"Reviewed in the United States May 11, 2024","profile_id":"AFU4T7QIJ2IYKQ763A5RU7BP7SPA","is_verified":true,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"},{"id":"R3D2VL78X76U52","title":"5.0 out of 5 stars She Loves Them","author":"Larry D. Stephney","rating":5,"content":"Bought them for my wife because she was going through low quality headphones way too fast.I got her these and I can only hear the game not her complaining about her headphones, bonus.","timestamp":"Reviewed in the United States May 2, 2024","profile_id":"AHL2HJZVEU7CNFBBCNHBVLYYCFLQ","is_verified":true,"product_attributes":"Color: Rose GoldStyle: Solo3Set: Without AppleCare+"},{"id":"RQN4W47MP8TGI","title":"5.0 out of 5 stars Husband’s gift","author":"Casey","rating":5,"content":"I tried to get a pair of headphones like the last ones he had but these were smaller than what I wanted. He still wears them to work out. The sound is good and they are very comfortable","timestamp":"Reviewed in the United States April 22, 2024","profile_id":"AGYP32WIYSNHYWBRKWI43FXOAKBA","is_verified":true,"product_attributes":"Color: SilverStyle: Solo3Set: Without AppleCare+"},{"id":"R23TCIRSYVF3K5","title":"4.0 out of 5 stars Beats solo 3 wi headphones","author":"Amazon Customer","rating":4,"content":"Liked the quality and sound","timestamp":"Reviewed in the United States May 3, 2024","profile_id":"AFYP3CKFVWKQ27CCYB473N4HK7SA","is_verified":true,"product_attributes":"Color: Rose GoldStyle: Solo3Set: Without AppleCare+"},{"id":"R1FUL24YFUCEW9","title":"5.0 out of 5 stars easy to use","author":"Amazon Customer","rating":5,"content":"great price perfect quality","timestamp":"Reviewed in the United States May 15, 2024","profile_id":"AHXOFVQXUJWYT2GWJFNFRAVIA3NA","is_verified":true,"product_attributes":"Color: Rose GoldStyle: Solo3Set: Without AppleCare+"},{"id":"R3MU4I2POOZ6J8","title":"4.0 out of 5 stars sound and battery","author":"Savannah loke","rating":4,"content":"I really like the color, came as expected. I would recommend getting the warranty because I ended up having sound issues and it was free to get a new pair from the Apple Store. If you are looking for good headphones you can use for phone calls I would not recommend, my friends have told me they can hear more of whats around me than me myself. I also would like to add that with the volume up higher than halfway others around you can hear your music. They charge really fast and will last me a week or two before I have to charge them again. For reference I use them on the bus ride to work and back each ride is about an hour and a half and I work 6 days a week.","timestamp":"Reviewed in the United States December 26, 2023","profile_id":"AESOSVMZ5LLJ2OHF4LIUP32YB4KA","is_verified":true,"helpful_count":2,"product_attributes":"Color: Rose GoldStyle: Solo3Set: Without AppleCare+"}],"page_type":"Question","asin_in_url":"B07YVYZ8T5","product_name":"Beats Solo3 Wireless On-Ear Headphones - Apple W1 Headphone Chip, Class 1 Bluetooth, 40 Hours of Listening Time, Built-in Microphone - Black","parse_status_code":12000},"created_at":"2024-07-06 09:54:50","updated_at":"2024-07-06 09:55:00","page":9,"url":"https://www.amazon.com/product-reviews/B07YVYZ8T5?reviewerType=all_reviews&pageNumber=9","job_id":"7215292100185711617","status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B07YVYZ8T5?reviewerType=all_reviews&pageNumber=10","asin":"B07YVYZ8T5","page":10,"pages":1,"reviews":[{"id":"R3JDJPHH0V6JK9","title":"5.0 out of 5 stars Hubby loves them","author":"Marie-Brandy","rating":5,"content":"My husband usually wears hearing aids. He doesn’t have to when he wants to listen to music now and he says they’re perfect for the gym.","timestamp":"Reviewed in the United States May 1, 2024","profile_id":"AGDF2AN7EGXDJURUC4CP4637OE6Q","is_verified":true,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"},{"id":"R3VC91XSUP4H78","title":"4.0 out of 5 stars Cute","author":"Kayla Wardell","rating":4,"content":"These are really cute. The sound is great. I didn’t get the noise canceling, but I can’t hear anything when I have them on. My only complaint is they really hurt my ears and give me a headache after awhile. Is it just me? Maybe I’m wearing them wrong. Maybe my ears are too big. Someone help me out here because I really want to love these.","timestamp":"Reviewed in the United States March 24, 2024","profile_id":"AHMJAPTQMAAOI6QEDLCLEDHEG3BA","is_verified":true,"product_attributes":"Color: Rose GoldStyle: Solo3Set: Without AppleCare+"},{"id":"R2K1ACO91OR210","title":"5.0 out of 5 stars 10 out of 10","author":"Erin Wells","rating":5,"content":"I love them. I love the color. Wish they got a touch louder but that's minor. I am very happy with them.","timestamp":"Reviewed in the United States May 2, 2024","profile_id":"AEBYLB7FYACTR7TNQYCKXSC4K6IQ","is_verified":true,"product_attributes":"Color: Rose GoldStyle: Solo3Set: Without AppleCare+"},{"id":"R2E9YW55BG7TN8","title":"5.0 out of 5 stars No sound out of one ear, hard to get help with even with the 2 year warranty","author":"Tracey T.","rating":5,"content":"Having a difficult time getting help and theyAren’t playing sounds out of one ear","timestamp":"Reviewed in the United States May 14, 2024","profile_id":"AHQA3D3CC733VZDVQBLDKF7LP6AA","is_verified":true,"product_attributes":"Color: Rose GoldStyle: Solo3Set: Without AppleCare+"},{"id":"RTEKUV2DCZ894","title":"5.0 out of 5 stars great gift","author":"Nakiya Pierce","rating":5,"content":"I got these beats for my boyfriend n he loves them they are very loud .","timestamp":"Reviewed in the United States May 14, 2024","profile_id":"AGNTCJLFUH2MYM664TPEYA75CEUA","is_verified":true,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"},{"id":"R21I6VEX9YNN4X","title":"5.0 out of 5 stars for doing inside things they are great","author":"Ashley Wilson","rating":5,"content":"but they are not so loud as i thought they would be they are good for around the house or work office","timestamp":"Reviewed in the United States May 5, 2024","profile_id":"AHCCESGVXMTPV2W4NW5QEF3YPZJQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"},{"id":"R2I09UWTU0ZW0Q","title":"4.0 out of 5 stars Sound is awesome","author":"Susan","rating":4,"content":"The sound is great but the mic isn’t when you’re on the phone. I think maybe it just picks up so much surround sound. Also if you have a smaller sized head then it’s probably going to be a bit loose. I use it on the smallest adjustable size and I thought I had a big head but guess not.","timestamp":"Reviewed in the United States April 17, 2024","profile_id":"AGEQDXX5EGYBSHBEE4APVJ2M6TZA","is_verified":true,"product_attributes":"Color: Rose GoldStyle: Solo3Set: Without AppleCare+"},{"id":"R1L09YV8IZBCMV","title":"5.0 out of 5 stars IN LOVE!!","author":"Kayana","rating":5,"content":"My boyfriend actually purchased this for me and let me tell you.. I INSTANTLY FELL IN LOVE WITH IT!!😍 It came with a charger and a hook (not sure what the hook is for but i could use it for something else). Battery life is AMAZING! Very very easy to connect to your phone. If you are thinking of getting these, do not hesitate! Very worth the money!","timestamp":"Reviewed in the United States April 12, 2024","profile_id":"AHKFCKC2OXIELF422RB4F3I5NWJQ","is_verified":true,"product_attributes":"Color: Rose GoldStyle: Solo3Set: Without AppleCare+"},{"id":"R3BWRJQC23MFT1","title":"5.0 out of 5 stars Great sound quality","author":"Amazon Customer","rating":5,"content":"Sounds great but thought I ordered pro but that’s my fault I wanted the larger size","timestamp":"Reviewed in the United States May 8, 2024","profile_id":"AH7EJ5RRVYDJRAFXF3EALDXVQJQQ","is_verified":true,"product_attributes":"Color: Rose GoldStyle: Solo3Set: Without AppleCare+"},{"id":"RSH4I36C91EBT","title":"4.0 out of 5 stars Battery life","author":"Sudin","rating":4,"content":"The battery life is very good. I don't have to charge it frequently.","timestamp":"Reviewed in the United States May 13, 2024","profile_id":"AEIFTCBGMNT4AADGA2TRT2HZDEMA","is_verified":true,"product_attributes":"Color: BlackStyle: Solo3Set: Without AppleCare+"}],"page_type":"Question","asin_in_url":"B07YVYZ8T5","product_name":"Beats Solo3 Wireless On-Ear Headphones - Apple W1 Headphone Chip, Class 1 Bluetooth, 40 Hours of Listening Time, Built-in Microphone - Black","parse_status_code":12000},"created_at":"2024-07-06 09:54:50","updated_at":"2024-07-06 09:55:01","page":10,"url":"https://www.amazon.com/product-reviews/B07YVYZ8T5?reviewerType=all_reviews&pageNumber=10","job_id":"7215292100185711617","status_code":200,"parser_type":""}],"job":{"callback_url":"https://realtime.oxylabs.io:443/api/done","client_id":18306,"context":[{"key":"force_headers","value":null},{"key":"force_cookies","value":false},{"key":"check_empty_geo","value":null},{"key":"safe_search","value":true}],"created_at":"2024-07-06 09:54:50","domain":"com","geo_location":null,"id":"7215292100185711617","limit":10,"locale":null,"pages":20,"parse":true,"parser_type":null,"parsing_instructions":null,"browser_instructions":null,"render":null,"url":null,"query":"B07YVYZ8T5","source":"amazon_reviews","start_page":1,"status":"done","storage_type":null,"storage_url":null,"subdomain":"www","content_encoding":"utf-8","updated_at":"2024-07-06 09:55:01","user_agent_type":"desktop","session_info":null,"statuses":[],"client_notes":null,"_links":[{"rel":"self","href":"http://data.oxylabs.io/v1/queries/7215292100185711617","method":"GET"},{"rel":"results","href":"http://data.oxylabs.io/v1/queries/7215292100185711617/results","method":"GET"},{"rel":"results-html","href":"http://data.oxylabs.io/v1/queries/7215292100185711617/results?type=raw","method":"GET"},{"rel":"results-parsed","href":"http://data.oxylabs.io/v1/queries/7215292100185711617/results?type=parsed","method":"GET"}]}}